# Apply Functions to DataFrame

In [17]:
import pandas as pd
import numpy as np
# Create Data
stuff = {
    'Corporation':['Apple', 'Google', 'Meta', 'Apple', 'Google','Meta'],
    'Employees':['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
    'Salary':[200, 220, 190, 130, 120, 150]}
# Create Dataframe
df = pd.DataFrame(stuff)
df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

## Create Function

In [18]:
# Create Function
def times10(x):
    return x * 10

## Use Apply function

In [19]:
# Use Apply function
df.Salary.apply(times10)

0    2000
1    2200
2    1900
3    1300
4    1200
5    1500
Name: Salary, dtype: int64

## Append to current DataFrame

In [20]:
# Append to current DataFrame
df.Salary = df.Salary.apply(times10)
df

  Corporation Employees  Salary
0       Apple      John    2000
1      Google     April    2200
2        Meta       Wes    1900
3       Apple      Beth    1300
4      Google    Justin    1200
5        Meta     Steph    1500

## Apply Function on multiple columns

In [21]:
# Apply Function on multiple columns
def namer(x):
    return "Codemy: " + x

## Apply to two columns

In [22]:
# Apply to two columns
df[["Corporation", "Employees"]].apply(namer)

      Corporation       Employees
0   Codemy: Apple    Codemy: John
1  Codemy: Google   Codemy: April
2    Codemy: Meta     Codemy: Wes
3   Codemy: Apple    Codemy: Beth
4  Codemy: Google  Codemy: Justin
5    Codemy: Meta   Codemy: Steph

## Append to DataFrame

In [23]:
# Use a lambda
df[["Corporation", "Employees"]] = df[["Corporation", "Employees"]].apply(namer)
df

      Corporation       Employees  Salary
0   Codemy: Apple    Codemy: John    2000
1  Codemy: Google   Codemy: April    2200
2    Codemy: Meta     Codemy: Wes    1900
3   Codemy: Apple    Codemy: Beth    1300
4  Codemy: Google  Codemy: Justin    1200
5    Codemy: Meta   Codemy: Steph    1500